# StructuralWallBottomProjectionPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralWallBottomProjectionPlane Property
ParameterTypeId Class See Also
---
"Bottom Vertical Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralWallBottomProjectionPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralWallBottomProjectionPlane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralWallBottomProjectionPlane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace